MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB110/mcu.h
#define AD1PCFG AD1PCFG
extern volatile uint16_t AD1PCFG __attribute__((__sfr__));
typedef struct tagAD1PCFGBITS {
  uint16_t PCFG0:1;
  uint16_t PCFG1:1;
  uint16_t PCFG2:1;
  uint16_t PCFG3:1;
  uint16_t PCFG4:1;
  uint16_t PCFG5:1;
  uint16_t PCFG6:1;
  uint16_t PCFG7:1;
  uint16_t PCFG8:1;
  uint16_t PCFG9:1;
  uint16_t PCFG10:1;
  uint16_t PCFG11:1;
  uint16_t PCFG12:1;
  uint16_t PCFG13:1;
  uint16_t PCFG14:1;
  uint16_t PCFG15:1;
} AD1PCFGBITS;
extern volatile AD1PCFGBITS AD1PCFGbits __attribute__((__sfr__));

#define AD1PCFGL AD1PCFGL
extern volatile uint16_t AD1PCFGL __attribute__((__sfr__));
typedef struct tagAD1PCFGLBITS {
  uint16_t PCFG0:1;
  uint16_t PCFG1:1;
  uint16_t PCFG2:1;
  uint16_t PCFG3:1;
  uint16_t PCFG4:1;
  uint16_t PCFG5:1;
  uint16_t PCFG6:1;
  uint16_t PCFG7:1;
  uint16_t PCFG8:1;
  uint16_t PCFG9:1;
  uint16_t PCFG10:1;
  uint16_t PCFG11:1;
  uint16_t PCFG12:1;
  uint16_t PCFG13:1;
  uint16_t PCFG14:1;
  uint16_t PCFG15:1;
} AD1PCFGLBITS;
extern volatile AD1PCFGLBITS AD1PCFGLbits __attribute__((__sfr__));

#define AD1CSSL AD1CSSL
extern volatile uint16_t AD1CSSL __attribute__((__sfr__));
typedef struct tagAD1CSSLBITS {
  uint16_t CSSL0:1;
  uint16_t CSSL1:1;
  uint16_t CSSL2:1;
  uint16_t CSSL3:1;
  uint16_t CSSL4:1;
  uint16_t CSSL5:1;
  uint16_t CSSL6:1;
  uint16_t CSSL7:1;
  uint16_t CSSL8:1;
  uint16_t CSSL9:1;
  uint16_t CSSL10:1;
  uint16_t CSSL11:1;
  uint16_t CSSL12:1;
  uint16_t CSSL13:1;
  uint16_t CSSL14:1;
  uint16_t CSSL15:1;
} AD1CSSLBITS;
extern volatile AD1CSSLBITS AD1CSSLbits __attribute__((__sfr__));

#define AD1CSSH AD1CSSH
extern volatile uint16_t AD1CSSH __attribute__((__sfr__));
typedef struct tagAD1CSSHBITS {
  uint16_t CSSL16:1;
  uint16_t CSSL17:1;
} AD1CSSHBITS;
extern volatile AD1CSSHBITS AD1CSSHbits __attribute__((__sfr__));

#define CTMUCON CTMUCON
extern volatile uint16_t CTMUCON __attribute__((__sfr__));
__extension__ typedef struct tagCTMUCONBITS {
  union {
    struct {
      uint16_t EDG1STAT:1;
      uint16_t EDG2STAT:1;
      uint16_t EDG1SEL:2;
      uint16_t EDG1POL:1;
      uint16_t EDG2SEL:2;
      uint16_t EDG2POL:1;
      uint16_t CTTRIG:1;
      uint16_t IDISSEN:1;
      uint16_t EDGSEQEN:1;
      uint16_t EDGEN:1;
      uint16_t TGEN:1;
      uint16_t CTMUSIDL:1;
      uint16_t :1;
      uint16_t CTMUEN:1;
    };
    struct {
      uint16_t :2;
      uint16_t EDG1SEL0:1;
      uint16_t EDG1SEL1:1;
      uint16_t :1;
      uint16_t EDG2SEL0:1;
      uint16_t EDG2SEL1:1;
    };
  };
} CTMUCONBITS;
extern volatile CTMUCONBITS CTMUCONbits __attribute__((__sfr__));

#define CTMUICON CTMUICON
extern volatile uint16_t CTMUICON __attribute__((__sfr__));
__extension__ typedef struct tagCTMUICONBITS {
  union {
    struct {
      uint16_t :8;
      uint16_t IRNG:2;
      uint16_t ITRIM:6;
    };
    struct {
      uint16_t :8;
      uint16_t IRNG0:1;
      uint16_t IRNG1:1;
      uint16_t ITRIM0:1;
      uint16_t ITRIM1:1;
      uint16_t ITRIM2:1;
      uint16_t ITRIM3:1;
      uint16_t ITRIM4:1;
      uint16_t ITRIM5:1;
    };
  };
} CTMUICONBITS;
extern volatile CTMUICONBITS CTMUICONbits __attribute__((__sfr__));

#define U1OTGIR U1OTGIR
extern volatile uint16_t U1OTGIR __attribute__((__sfr__));
typedef struct tagU1OTGIRBITS {
  uint16_t VBUSVDIF:1;
  uint16_t :1;
  uint16_t SESENDIF:1;
  uint16_t SESVDIF:1;
  uint16_t ACTVIF:1;
  uint16_t LSTATEIF:1;
  uint16_t T1MSECIF:1;
  uint16_t IDIF:1;
} U1OTGIRBITS;
extern volatile U1OTGIRBITS U1OTGIRbits __attribute__((__sfr__));

#define U1OTGIE U1OTGIE
extern volatile uint16_t U1OTGIE __attribute__((__sfr__));
typedef struct tagU1OTGIEBITS {
  uint16_t VBUSVDIE:1;
  uint16_t :1;
  uint16_t SESENDIE:1;
  uint16_t SESVDIE:1;
  uint16_t ACTVIE:1;
  uint16_t LSTATEIE:1;
  uint16_t T1MSECIE:1;
  uint16_t IDIE:1;
} U1OTGIEBITS;
extern volatile U1OTGIEBITS U1OTGIEbits __attribute__((__sfr__));

#define U1OTGSTAT U1OTGSTAT
extern volatile uint16_t U1OTGSTAT __attribute__((__sfr__));
typedef struct tagU1OTGSTATBITS {
  uint16_t VBUSVD:1;
  uint16_t :1;
  uint16_t SESEND:1;
  uint16_t SESVD:1;
  uint16_t :1;
  uint16_t LSTATE:1;
  uint16_t :1;
  uint16_t ID:1;
} U1OTGSTATBITS;
extern volatile U1OTGSTATBITS U1OTGSTATbits __attribute__((__sfr__));

#define U1OTGCON U1OTGCON
extern volatile uint16_t U1OTGCON __attribute__((__sfr__));
typedef struct tagU1OTGCONBITS {
  uint16_t VBUSDIS:1;
  uint16_t VBUSCHG:1;
  uint16_t OTGEN:1;
  uint16_t VBUSON:1;
  uint16_t DMPULDWN:1;
  uint16_t DPPULDWN:1;
  uint16_t DMPULUP:1;
  uint16_t DPPULUP:1;
} U1OTGCONBITS;
extern volatile U1OTGCONBITS U1OTGCONbits __attribute__((__sfr__));

#define U1PWRC U1PWRC
extern volatile uint16_t U1PWRC __attribute__((__sfr__));
__extension__ typedef struct tagU1PWRCBITS {
  union {
    struct {
      uint16_t USBPWR:1;
      uint16_t USUSPEND:1;
      uint16_t :2;
      uint16_t USLPGRD:1;
      uint16_t :2;
      uint16_t UACTPND:1;
    };
    struct {
      uint16_t :1;
      uint16_t USUSPND:1;
    };
  };
} U1PWRCBITS;
extern volatile U1PWRCBITS U1PWRCbits __attribute__((__sfr__));

#define U1IR U1IR
extern volatile uint16_t U1IR __attribute__((__sfr__));
__extension__ typedef struct tagU1IRBITS {
  union {
    struct {
      uint16_t URSTIF:1;
      uint16_t UERRIF:1;
      uint16_t SOFIF:1;
      uint16_t TRNIF:1;
      uint16_t IDLEIF:1;
      uint16_t RESUMEIF:1;
      uint16_t ATTACHIF:1;
      uint16_t STALLIF:1;
    };
    struct {
      uint16_t DETACHIF:1;
    };
  };
} U1IRBITS;
extern volatile U1IRBITS U1IRbits __attribute__((__sfr__));

#define U1IE U1IE
extern volatile uint16_t U1IE __attribute__((__sfr__));
__extension__ typedef struct tagU1IEBITS {
  union {
    struct {
      uint16_t URSTIE:1;
      uint16_t UERRIE:1;
      uint16_t SOFIE:1;
      uint16_t TRNIE:1;
      uint16_t IDLEIE:1;
      uint16_t RESUMEIE:1;
      uint16_t ATTACHIE:1;
      uint16_t STALLIE:1;
    };
    struct {
      uint16_t DETACHIE:1;
    };
  };
} U1IEBITS;
extern volatile U1IEBITS U1IEbits __attribute__((__sfr__));

#define U1EIR U1EIR
extern volatile uint16_t U1EIR __attribute__((__sfr__));
__extension__ typedef struct tagU1EIRBITS {
  union {
    struct {
      uint16_t PIDEF:1;
      uint16_t CRC5EF:1;
      uint16_t CRC16EF:1;
      uint16_t DFN8EF:1;
      uint16_t BTOEF:1;
      uint16_t DMAEF:1;
      uint16_t :1;
      uint16_t BTSEF:1;
    };
    struct {
      uint16_t :1;
      uint16_t EOFEF:1;
    };
  };
} U1EIRBITS;
extern volatile U1EIRBITS U1EIRbits __attribute__((__sfr__));

