MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB110/mcu.h
/* CNEN3 */
#define _CN32IE CNEN3bits.CN32IE
#define _CN33IE CNEN3bits.CN33IE
#define _CN34IE CNEN3bits.CN34IE
#define _CN35IE CNEN3bits.CN35IE
#define _CN36IE CNEN3bits.CN36IE
#define _CN37IE CNEN3bits.CN37IE
#define _CN38IE CNEN3bits.CN38IE
#define _CN39IE CNEN3bits.CN39IE
#define _CN40IE CNEN3bits.CN40IE
#define _CN41IE CNEN3bits.CN41IE
#define _CN42IE CNEN3bits.CN42IE
#define _CN43IE CNEN3bits.CN43IE
#define _CN44IE CNEN3bits.CN44IE
#define _CN45IE CNEN3bits.CN45IE
#define _CN46IE CNEN3bits.CN46IE
#define _CN47IE CNEN3bits.CN47IE

/* CNEN4 */
#define _CN48IE CNEN4bits.CN48IE
#define _CN49IE CNEN4bits.CN49IE
#define _CN50IE CNEN4bits.CN50IE
#define _CN51IE CNEN4bits.CN51IE
#define _CN52IE CNEN4bits.CN52IE
#define _CN53IE CNEN4bits.CN53IE
#define _CN54IE CNEN4bits.CN54IE
#define _CN55IE CNEN4bits.CN55IE
#define _CN56IE CNEN4bits.CN56IE
#define _CN57IE CNEN4bits.CN57IE
#define _CN58IE CNEN4bits.CN58IE
#define _CN59IE CNEN4bits.CN59IE
#define _CN60IE CNEN4bits.CN60IE
#define _CN61IE CNEN4bits.CN61IE
#define _CN62IE CNEN4bits.CN62IE
#define _CN63IE CNEN4bits.CN63IE

/* CNEN5 */
#define _CN64IE CNEN5bits.CN64IE
#define _CN65IE CNEN5bits.CN65IE
#define _CN66IE CNEN5bits.CN66IE
#define _CN67IE CNEN5bits.CN67IE
#define _CN68IE CNEN5bits.CN68IE
#define _CN69IE CNEN5bits.CN69IE
#define _CN70IE CNEN5bits.CN70IE
#define _CN71IE CNEN5bits.CN71IE
#define _CN74IE CNEN5bits.CN74IE
#define _CN75IE CNEN5bits.CN75IE
#define _CN76IE CNEN5bits.CN76IE
#define _CN77IE CNEN5bits.CN77IE
#define _CN78IE CNEN5bits.CN78IE
#define _CN79IE CNEN5bits.CN79IE

/* CNEN6 */
#define _CN80IE CNEN6bits.CN80IE
#define _CN81IE CNEN6bits.CN81IE
#define _CN82IE CNEN6bits.CN82IE

/* CNPU1 */
#define _CN0PUE CNPU1bits.CN0PUE
#define _CN1PUE CNPU1bits.CN1PUE
#define _CN2PUE CNPU1bits.CN2PUE
#define _CN3PUE CNPU1bits.CN3PUE
#define _CN4PUE CNPU1bits.CN4PUE
#define _CN5PUE CNPU1bits.CN5PUE
#define _CN6PUE CNPU1bits.CN6PUE
#define _CN7PUE CNPU1bits.CN7PUE
#define _CN8PUE CNPU1bits.CN8PUE
#define _CN9PUE CNPU1bits.CN9PUE
#define _CN10PUE CNPU1bits.CN10PUE
#define _CN11PUE CNPU1bits.CN11PUE
#define _CN12PUE CNPU1bits.CN12PUE
#define _CN13PUE CNPU1bits.CN13PUE
#define _CN14PUE CNPU1bits.CN14PUE
#define _CN15PUE CNPU1bits.CN15PUE

/* CNPU2 */
#define _CN16PUE CNPU2bits.CN16PUE
#define _CN17PUE CNPU2bits.CN17PUE
#define _CN18PUE CNPU2bits.CN18PUE
#define _CN19PUE CNPU2bits.CN19PUE
#define _CN20PUE CNPU2bits.CN20PUE
#define _CN21PUE CNPU2bits.CN21PUE
#define _CN22PUE CNPU2bits.CN22PUE
#define _CN23PUE CNPU2bits.CN23PUE
#define _CN24PUE CNPU2bits.CN24PUE
#define _CN25PUE CNPU2bits.CN25PUE
#define _CN26PUE CNPU2bits.CN26PUE
#define _CN27PUE CNPU2bits.CN27PUE
#define _CN28PUE CNPU2bits.CN28PUE
#define _CN29PUE CNPU2bits.CN29PUE
#define _CN30PUE CNPU2bits.CN30PUE
#define _CN31PUE CNPU2bits.CN31PUE

/* CNPU3 */
#define _CN32PUE CNPU3bits.CN32PUE
#define _CN33PUE CNPU3bits.CN33PUE
#define _CN34PUE CNPU3bits.CN34PUE
#define _CN35PUE CNPU3bits.CN35PUE
#define _CN36PUE CNPU3bits.CN36PUE
#define _CN37PUE CNPU3bits.CN37PUE
#define _CN38PUE CNPU3bits.CN38PUE
#define _CN39PUE CNPU3bits.CN39PUE
#define _CN40PUE CNPU3bits.CN40PUE
#define _CN41PUE CNPU3bits.CN41PUE
#define _CN42PUE CNPU3bits.CN42PUE
#define _CN43PUE CNPU3bits.CN43PUE
#define _CN44PUE CNPU3bits.CN44PUE
#define _CN45PUE CNPU3bits.CN45PUE
#define _CN46PUE CNPU3bits.CN46PUE
#define _CN47PUE CNPU3bits.CN47PUE

/* CNPU4 */
#define _CN48PUE CNPU4bits.CN48PUE
#define _CN49PUE CNPU4bits.CN49PUE
#define _CN50PUE CNPU4bits.CN50PUE
#define _CN51PUE CNPU4bits.CN51PUE
#define _CN52PUE CNPU4bits.CN52PUE
#define _CN53PUE CNPU4bits.CN53PUE
#define _CN54PUE CNPU4bits.CN54PUE
#define _CN55PUE CNPU4bits.CN55PUE
#define _CN56PUE CNPU4bits.CN56PUE
#define _CN57PUE CNPU4bits.CN57PUE
#define _CN58PUE CNPU4bits.CN58PUE
#define _CN59PUE CNPU4bits.CN59PUE
#define _CN60PUE CNPU4bits.CN60PUE
#define _CN61PUE CNPU4bits.CN61PUE
#define _CN62PUE CNPU4bits.CN62PUE
#define _CN63PUE CNPU4bits.CN63PUE

/* CNPU5 */
#define _CN64PUE CNPU5bits.CN64PUE
#define _CN65PUE CNPU5bits.CN65PUE
#define _CN66PUE CNPU5bits.CN66PUE
#define _CN67PUE CNPU5bits.CN67PUE
#define _CN68PUE CNPU5bits.CN68PUE
#define _CN69PUE CNPU5bits.CN69PUE
#define _CN70PUE CNPU5bits.CN70PUE
#define _CN71PUE CNPU5bits.CN71PUE
#define _CN74PUE CNPU5bits.CN74PUE
#define _CN75PUE CNPU5bits.CN75PUE
#define _CN76PUE CNPU5bits.CN76PUE
#define _CN77PUE CNPU5bits.CN77PUE
#define _CN78PUE CNPU5bits.CN78PUE
#define _CN79PUE CNPU5bits.CN79PUE

/* CNPU6 */
#define _CN80PUE CNPU6bits.CN80PUE
#define _CN81PUE CNPU6bits.CN81PUE
#define _CN82PUE CNPU6bits.CN82PUE

/* INTCON1 */
#define _OSCFAIL INTCON1bits.OSCFAIL
#define _STKERR INTCON1bits.STKERR
#define _ADDRERR INTCON1bits.ADDRERR
#define _MATHERR INTCON1bits.MATHERR
#define _NSTDIS INTCON1bits.NSTDIS

/* INTCON2 */
#define _INT0EP INTCON2bits.INT0EP
#define _INT1EP INTCON2bits.INT1EP
#define _INT2EP INTCON2bits.INT2EP
#define _INT3EP INTCON2bits.INT3EP
#define _INT4EP INTCON2bits.INT4EP
#define _DISI INTCON2bits.DISI
#define _ALTIVT INTCON2bits.ALTIVT

/* IFS0 */
#define _INT0IF IFS0bits.INT0IF
#define _IC1IF IFS0bits.IC1IF
#define _OC1IF IFS0bits.OC1IF
#define _T1IF IFS0bits.T1IF
#define _IC2IF IFS0bits.IC2IF
#define _OC2IF IFS0bits.OC2IF
#define _T2IF IFS0bits.T2IF
#define _T3IF IFS0bits.T3IF
#define _SPF1IF IFS0bits.SPF1IF
#define _SPI1IF IFS0bits.SPI1IF
#define _U1RXIF IFS0bits.U1RXIF
#define _U1TXIF IFS0bits.U1TXIF
#define _AD1IF IFS0bits.AD1IF

/* IFS1 */
#define _SI2C1IF IFS1bits.SI2C1IF
#define _MI2C1IF IFS1bits.MI2C1IF
#define _CMIF IFS1bits.CMIF
#define _CNIF IFS1bits.CNIF
#define _INT1IF IFS1bits.INT1IF
#define _IC7IF IFS1bits.IC7IF
#define _IC8IF IFS1bits.IC8IF
#define _OC3IF IFS1bits.OC3IF
#define _OC4IF IFS1bits.OC4IF
#define _T4IF IFS1bits.T4IF
#define _T5IF IFS1bits.T5IF
#define _INT2IF IFS1bits.INT2IF
#define _U2RXIF IFS1bits.U2RXIF
#define _U2TXIF IFS1bits.U2TXIF

/* IFS2 */
#define _SPF2IF IFS2bits.SPF2IF
#define _SPI2IF IFS2bits.SPI2IF
#define _IC3IF IFS2bits.IC3IF
#define _IC4IF IFS2bits.IC4IF
#define _IC5IF IFS2bits.IC5IF
#define _IC6IF IFS2bits.IC6IF
#define _OC5IF IFS2bits.OC5IF
#define _OC6IF IFS2bits.OC6IF
#define _OC7IF IFS2bits.OC7IF
#define _OC8IF IFS2bits.OC8IF
#define _PMPIF IFS2bits.PMPIF

/* IFS3 */
#define _SI2C2IF IFS3bits.SI2C2IF
#define _MI2C2IF IFS3bits.MI2C2IF
#define _INT3IF IFS3bits.INT3IF
#define _INT4IF IFS3bits.INT4IF
#define _RTCIF IFS3bits.RTCIF

/* IFS4 */
#define _U1ERIF IFS4bits.U1ERIF
#define _U2ERIF IFS4bits.U2ERIF
#define _CRCIF IFS4bits.CRCIF
#define _LVDIF IFS4bits.LVDIF
#define _CTMUIF IFS4bits.CTMUIF

/* IFS5 */
#define _U3ERIF IFS5bits.U3ERIF
#define _U3RXIF IFS5bits.U3RXIF
#define _U3TXIF IFS5bits.U3TXIF
#define _SI2C3IF IFS5bits.SI2C3IF
#define _MI2C3IF IFS5bits.MI2C3IF
#define _USB1IF IFS5bits.USB1IF
#define _U4ERIF IFS5bits.U4ERIF
#define _U4RXIF IFS5bits.U4RXIF
#define _U4TXIF IFS5bits.U4TXIF
#define _SPF3IF IFS5bits.SPF3IF
#define _SPI3IF IFS5bits.SPI3IF
#define _OC9IF IFS5bits.OC9IF
#define _IC9IF IFS5bits.IC9IF

